In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import itertools

# Read/Save to Excel data

In [2]:
excel_data = pd.read_excel('excel_test_data.xlsx', sheet_name=None)
print('Sheet names:', excel_data.keys())
df = excel_data['sheet3']
df.head(22)

Sheet names: dict_keys(['sheet1', 'sheet2', 'sheet3'])

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,[B2] start of ill-format excel file,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,[A8] second data appearance,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,[A13] contiguous column data,[B13] contiguous column data,[C13] contiguous column data,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,[A16] contiguous row data,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,[A17] contiguous row data,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,[A18] contiguous row data,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,[A2] jumping column data,NaN,NaN,NaN,NaN,NaN,[G22] jumping column data,[H22] jumping column data

Check [here](https://stackoverflow.com/questions/42370977/how-to-save-a-new-sheet-in-an-existing-excel-file-using-pandas) for inserting new sheets to existing Excel files.

In [3]:
# excel_data['sheet3'].to_excel('excel_test_output.xlsx', index=False, sheet_name='sheet3_output', header=None)
excel_data['sheet1'].to_excel('excel_test_output.xlsx', index=False)

For concat, merge, join, etc., see a very good description/example [here](https://pandas.pydata.org/docs/user_guide/merging.html)

In [4]:
df1 = excel_data['sheet1']
df2 = excel_data['sheet2']
df3 = excel_data['sheet3']

In [5]:
pd.concat([df1, df2], axis=1, ignore_index=False, )

   purge  pulse  is_high_dilute  NH3_pulse  NH3_purge  is_high_dilute
0   0.25   0.75               1          1       1.25               0
1   0.15   0.45               1          1       2.50               0
2   0.25   0.75               1          2       2.50               1
3   0.25   0.75               0          2       5.00               0
4   0.15   0.60               0          3       3.75               1
5   0.15   0.60               1          3       4.00               1

### combination generator

In [6]:
a = ["foo", "melon"]
b = [True, False]
c = list(itertools.product(a, b))
pd.DataFrame(c,columns=['type', 'status'])

    type  status
0    foo    True
1    foo   False
2  melon    True
3  melon   False

# batch for THK prediction

In [7]:
recipe = pd.DataFrame([[0.25, 0.75]], columns=['pulse', 'purge'])
cycle = pd.Series(np.linspace(10,15,6),name='cycle').astype('int64')
print(recipe)
print()
print(cycle)
pd.merge(recipe, cycle, how='cross').sort_values('cycle', ascending=False)

   pulse  purge
0   0.25   0.75

0    10
1    11
2    12
3    13
4    14
5    15
Name: cycle, dtype: int64

   pulse  purge  cycle
5   0.25   0.75     15
4   0.25   0.75     14
3   0.25   0.75     13
2   0.25   0.75     12
1   0.25   0.75     11
0   0.25   0.75     10